# MepCondenserWaterLoop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepCondenserWaterLoop Property
ParameterTypeId Class See Also
---
"Condenser Water Loop"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepCondenserWaterLoop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepCondenserWaterLoop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepCondenserWaterLoop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace